astb_relise/src/Documents/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботу</name>
  <registerRecords>InformationRegister.ДоступныеУсловияРаботыСотрудника</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>AccumulationRegister.ЗанятыеРабочиеМеста</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <registerRecords>InformationRegister.ОсновноеМестоРаботыСотрудника</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/ЗанятыеРабочиеМеста/ЗанятыеРабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятыеРабочиеМеста</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ШтатноеРасписание/ШтатноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтатноеРасписание</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/AccumulationRegisters/ПотребностьВыдачиСИЗ/ПотребностьВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностьВыдачиСИЗ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентИзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/AccumulationRegisters/ВыдачаПоПотребности/ВыдачаПоПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаПоПотребности</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/Documents/ПриемНаРаботу/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ОбменДанными.Загрузка и Режим = РежимПроведенияДокумента.Оперативный И Организация.КонтролироватьКоличествоСтавокПоШтатномуРасписанию Тогда
		
		ТаблицаРаботников = Работники.Выгрузить(,"Подразделение,Должность,ЗанимаемыхСтавок");
		ТаблицаРаботников.Свернуть("Подразделение,Должность","ЗанимаемыхСтавок");
		ТаблицаРаботников.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТаблицаРаботников.ЗаполнитьЗначения(Организация,"Организация");
		
		Запрос = Новый Запрос;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТЗ.Подразделение КАК Подразделение,
		               |	ТЗ.Должность КАК Должность,
		               |	ТЗ.Организация КАК Организация,
		               |	ТЗ.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок
		               |ПОМЕСТИТЬ ТЗФайл
		               |ИЗ
		               |	&Таблица КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗанятыеРабочиеМестаОстатки.Подразделение КАК Подразделение,
		               |	ЗанятыеРабочиеМестаОстатки.Должность КАК Должность,
		               |	СУММА(ЗанятыеРабочиеМестаОстатки.КоличествоОстаток) КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ВТ_ЗРМ
		               |ИЗ
		               |	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(&ДатаАнализа, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗанятыеРабочиеМестаОстатки.Подразделение,
		               |	ЗанятыеРабочиеМестаОстатки.Должность
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТЗФайл.Организация КАК Организация,
		               |	ТЗФайл.Подразделение КАК Подразделение,
		               |	ТЗФайл.Должность КАК Должность,
		               |	СУММА((ЕСТЬNULL(ШтатноеРасписаниеСрезПоследних.КоличествоСтавок, 0) - ТЗФайл.ЗанимаемыхСтавок - ЕСТЬNULL(ВТ_ЗРМ.КоличествоОстаток, 0)) * -1) КАК Ставка
		               |ИЗ
		               |	ТЗФайл КАК ТЗФайл
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписание.СрезПоследних(&ДатаАнализа, Организация = &Организация) КАК ШтатноеРасписаниеСрезПоследних
		               |		ПО (ШтатноеРасписаниеСрезПоследних.Подразделение = ТЗФайл.Подразделение)
		               |			И (ШтатноеРасписаниеСрезПоследних.Должность = ТЗФайл.Должность)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗРМ КАК ВТ_ЗРМ
		               |		ПО ТЗФайл.Подразделение = ВТ_ЗРМ.Подразделение
		               |			И ТЗФайл.Должность = ВТ_ЗРМ.Должность
		               |ГДЕ
		               |	ЕСТЬNULL(ШтатноеРасписаниеСрезПоследних.КоличествоСтавок, 0) - ТЗФайл.ЗанимаемыхСтавок - ЕСТЬNULL(ВТ_ЗРМ.КоличествоОстаток, 0) < 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЗФайл.Должность,
		               |	ТЗФайл.Подразделение,
		               |	ТЗФайл.Организация";
		Запрос.УстановитьПараметр("Таблица",	ТаблицаРаботников); 
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("ДатаАнализа",ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Ссылка));
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			Отказ = Истина;
			Для каждого СтрокаРез из Результат Цикл
				Сообщить("В штатном расписании для организации " + Организация + ", подразделения " + СтрокаРез.Подразделение + ", должности "+ СтрокаРез.Должность 
				+ " указано меньшее количество ставок (на "+ СтрокаРез.Ставка + "шт.)");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если не Отказ Тогда
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
		Документы.ПриемНаРаботу.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		ЗапасыСерверПереопределяемый.ОтразитьЗанятыеРабочиеМеста(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСерверПереопределяемый.ОтразитьДоступныеУсловияРаботыСотрудника(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСерверПереопределяемый.ОтразитьПотребностьВыдачиСИЗ(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСерверПереопределяемый.ОтразитьВыдачуПоПотребности(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСерверПереопределяемый.ОтразитьОсновноеМестоРаботыСотрудника(ДополнительныеСвойства, Движения, Отказ);
		СформироватьСписокРегистровДляКонтроля();
		ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроведениеСервер.ПроверитьЗаполнениеТабельныхНомеров(ЭтотОбъект,Отказ,"Работники");
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	//Контроль выполняется при проведении\отмене проведения не нового документа.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Массив.Добавить(Движения.ПотребностьВыдачиСИЗ);
		Массив.Добавить(Движения.ВыдачаПоПотребности);
	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецЕсли
